
#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.mine_server_rg: Reading...
azurerm_public_ip.mine_lb_public_ip: Refreshing state... [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Network/publicIPAddresses/mine-lb-public-ip]
data.azurerm_resource_group.mine_server_rg: Read complete after 0s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg]
data.azurerm_storage_account.mine_server_storage: Reading...
data.azurerm_storage_account.mine_server_storage: Read complete after 1s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa]
azurerm_storage_share.mine_file_share: Refreshing state... [id=https://mineserversa.file.core.windows.net/mineserverfileshare]
azurerm_container_group.mine_server: Refreshing state... [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.ContainerInstance/containerGroups/mine-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.mine_server must be replaced
-/+ resource "azurerm_container_group" "mine_server" {
      ~ dns_name_label_reuse_policy = "Noreuse" -> "Unsecure"
      ~ exposed_port                = [
          - {
              - port     = 25565
              - protocol = "TCP"
            },
          - {
              - port     = 25575
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                        = "folly-mine-server.deeaekhbgcgvbzah.brazilsouth.azurecontainer.io" -> (known after apply)
      ~ id                          = "/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.ContainerInstance/containerGroups/mine-server" -> (known after apply)
      ~ ip_address                  = "20.226.232.172" -> (known after apply)
        name                        = "mine-server"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (7 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          ~ cpu                          = 4 -> 3 # forces replacement
          - cpu_limit                    = 0 -> null
          ~ memory                       = 8 -> 6 # forces replacement
          - memory_limit                 = 0 -> null
            name                         = "mine-container"
          - secure_environment_variables = (sensitive value) -> null
            # (2 unchanged attributes hidden)

          ~ volume {
                name                 = "mine-volume"
              - secret               = (sensitive value) -> null
                # (6 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # azurerm_public_ip.mine_lb_public_ip will be destroyed
  # (because azurerm_public_ip.mine_lb_public_ip is not in configuration)
  - resource "azurerm_public_ip" "mine_lb_public_ip" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Network/publicIPAddresses/mine-lb-public-ip" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "20.226.127.200" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "brazilsouth" -> null
      - name                    = "mine-lb-public-ip" -> null
      - resource_group_name     = "mine-server-rg" -> null
      - sku                     = "Basic" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {} -> null
      - zones                   = [] -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mfollypp, Action: `pull_request`, Workflow: `Terraform`*